app/Controllers/DaftarPenggunaController.php

    public function edit_pengguna($id = null)
    {
        $data['datauser'] = $this->karyawanModel->where(['nik' => user()->nik])->first();
---
SELECT *
FROM "users"
WHERE "nik" = '1371041108920058'
 LIMIT 1