app/Controllers/DaftarKaryawanController.php

SELECT *
FROM "jabatan"
SELECT *
FROM "divisi"
---
    public function tambah_karyawan()
    {
        $data['users'] = $this->penggunaModel->getPengguna();
        $data['jabatan'] = $this->jabatanModel->findAll();
        $data['divisi'] = $this->divisiModel->findAll();

SELECT *
FROM "jabatan"
SELECT *
FROM "karyawan"
WHERE "karyawan"."id_karyawan" = '47'
---
    public function lihat_karyawan($id_karyawan = null)
    {
        $data['users'] = $this->penggunaModel->getPengguna();
        $data['jabatan'] = $this->jabatanModel->findAll();
        $data['transaksi'] = $this->transaksiModel->getTransaksi();
        $data['transaksi'] = $this->transaksiModel->getJenisTransaksi();
        $data['transaksi'] = $this->transaksiModel->getSertifikatPerIDLihat($id_karyawan);
        $data['detail_karyawan'] = $this->karyawanModel->getKaryawanPerID($id_karyawan);
        $data['detail_karyawan'] = $this->karyawanModel->where(['id_karyawan' => $id_karyawan])->first();

SELECT *
FROM "karyawan"
WHERE "nik" = '1371025811790004'
 LIMIT 1
SELECT *
FROM "jabatan"
SELECT *
FROM "divisi"
---
    public function edit_karyawan($id_karyawan = null)
    {
        $data['users'] = $this->penggunaModel->getPengguna();
        $data['transaksi'] = $this->transaksiModel->getTransaksi();
        $data['transaksi'] = $this->transaksiModel->getJenisTransaksi();
        $data['transaksi'] = $this->transaksiModel->getSertifikatPerID($id_karyawan);
        $data['sertifikat'] = $this->sertifikatModel->getJenisSertifikat();
        $data['jenissertifikat'] = $this->sertifikatModel->getJenisSertifikat();
        $data['karyawan'] = $this->karyawanEditModel->getKaryawanPerID($id_karyawan);
        $data['karyawan'] = $this->karyawanEditModel->where(['nik' => $id_karyawan])->first();
        $data['jabatan'] = $this->jabatanModel->findAll();
        $data['divisi'] = $this->divisiModel->findAll();

SELECT *
FROM "jabatan"
---
    public function edit_karyawandisable($id_karyawan = null)
    {
        $data['users'] = $this->penggunaModel->getPengguna();
        $data['transaksi'] = $this->transaksiModel->getTransaksi();
        $data['transaksi'] = $this->transaksiModel->getJenisTransaksi();
        $data['transaksi'] = $this->transaksiModel->getSertifikatPerID($id_karyawan);
        $data['sertifikat'] = $this->sertifikatModel->getJenisSertifikat();
        $data['jenissertifikat'] = $this->sertifikatModel->getJenisSertifikat();
        $data['karyawan'] = $this->karyawanEditModel->getKaryawanPerID($id_karyawan);
        $data['karyawan'] = $this->karyawanEditModel->where(['nik' => $id_karyawan])->first();
        $data['jabatan'] = $this->jabatanModel->findAll();