app/Controllers/DaftarKaryawanController.php

    public function edit_karyawan($id_karyawan = null)
    {
        $data['transaksi'] = $this->transaksiModel->getTransaksi();
        $data['transaksi'] = $this->transaksiModel->getJenisTransaksi();
        $data['transaksi'] = $this->transaksiModel->getSertifikatPerID($id_karyawan);
        $data['sertifikat'] = $this->sertifikatModel->getJenisSertifikat();
        $data['jenissertifikat'] = $this->sertifikatModel->getJenisSertifikat();
        $data['karyawan'] = $this->karyawanModel->find($id_karyawan);
        $data['jabatan'] = $this->jabatanModel->findAll();
        $data['divisi'] = $this->divisiModel->findAll();
---
SELECT *
FROM "karyawan"
WHERE "karyawan"."id_karyawan" = '46'
SELECT *
FROM "jabatan"
SELECT *
FROM "divisi"

    public function edit_karyawandisable($id_karyawan = null)
    {
        $data['transaksi'] = $this->transaksiModel->getTransaksi();
        $data['transaksi'] = $this->transaksiModel->getJenisTransaksi();
        $data['transaksi'] = $this->transaksiModel->getSertifikatPerID($id_karyawan);
        $data['sertifikat'] = $this->sertifikatModel->getJenisSertifikat();
        $data['jenissertifikat'] = $this->sertifikatModel->getJenisSertifikat();
        $data['karyawan'] = $this->karyawanModel->find($id_karyawan);
        $data['jabatan'] = $this->jabatanModel->findAll();
        $data['divisi'] = $this->divisiModel->findAll();
---
SELECT *
FROM "karyawan"
WHERE "karyawan"."id_karyawan" = '10'
SELECT *
FROM "divisi"