app/Controllers/DaftarKaryawanController.php

SELECT *
FROM "karyawan"
WHERE "nik" = '1371041108920001'
 LIMIT 1
---
    public function laporan()
    {
        $data['datauser'] = $this->karyawanModel->where(['nik' => user()->nik])->first();

SELECT *
FROM "karyawan"
WHERE "nik" = '1111222233334444'
 LIMIT 1
---
    public function index_karyawan()
    {
        $data['datauser'] = $this->karyawanModel->where(['nik' => user()->nik])->first();

SELECT *
FROM "karyawan"
WHERE "id_karyawan" = '1695162034'
 LIMIT 1
---
    public function lihat_karyawan($id_karyawan = null)
    {
        $data = $this->karyawanModel->where(['id_karyawan' => $id_karyawan])->findAll();
        if ($data == false || count($data) < 1) {
            return "";
        }
        $qrCode = QrCode::create(base_url('view_karyawanQR/' . $id_karyawan))
            ->setEncoding(new Encoding('UTF-8'))
            ->setErrorCorrectionLevel(new ErrorCorrectionLevelLow())
            ->setSize(300)
            ->setMargin(10)
            ->setRoundBlockSizeMode(new RoundBlockSizeModeMargin())
            ->setForegroundColor(new Color(0, 0, 0))
            ->setBackgroundColor(new Color(255, 255, 255));
        $writer     = new PngWriter();

        $logo = Logo::create('logo.png')
            ->setResizeToWidth(150);

        $label = Label::create($data[0]['nama_karyawan'])
            ->setTextColor(new Color(255, 0, 0));

        $result = $writer->write($qrCode, null, $label);
        // header('Content-Type: ' . $result->getMimeType());
        // die($result->getString());

        $data['datauser'] = $this->karyawanModel->where(['nik' => user()->nik])->first();
        $data['users'] = $this->penggunaModel->getPengguna();
        $data['jabatan'] = $this->jabatanModel->findAll();

SELECT *
FROM "karyawan"
WHERE "id_karyawan" = '1695544403'
 LIMIT 1
---
        $data['transaksi'] = $this->transaksiModel->getJenisTransaksi();
        $data['transaksi'] = $this->transaksiModel->getSertifikatPerIDLihat($id_karyawan);
        $data['detail_karyawan'] = $this->karyawanModel->getKaryawanPerID($id_karyawan);
        $data['detail_karyawan'] = $this->karyawanModel->where(['id_karyawan' => $id_karyawan])->first();

SELECT *
FROM "users"
WHERE "nik" = '1371041108920001'
 LIMIT 1
SELECT *
FROM "karyawan"
WHERE "nik" = '1371041108920001'
 LIMIT 1
---
    public function edit_karyawan($id_karyawan = null)
    {
        $data['datauser'] = $this->karyawanModel->where(['nik' => user()->nik])->first();
        $data['users'] = $this->penggunaModel->getPengguna();
        $data['transaksi'] = $this->transaksiModel->getTransaksi();
        $data['transaksi'] = $this->transaksiModel->getJenisTransaksi();
        $data['transaksi'] = $this->transaksiModel->getSertifikatPerID($id_karyawan);
        $data['sertifikat'] = $this->sertifikatModel->getJenisSertifikat();
        $data['jenissertifikat'] = $this->sertifikatModel->getJenisSertifikat();
        $data['karyawan'] = $this->karyawanEditModel->getKaryawanPerID($id_karyawan);
        $data['karyawan'] = $this->karyawanEditModel->where(['nik' => $id_karyawan])->first();