app/Models/DaftarDivisiModel.php

    public function getDivisi()
    {
        return $this->db->table('divisi')
        ->get()->getResultArray();
---
SELECT *
FROM "divisi"