app/Models/DaftarKaryawanEditModel.php

SELECT *
FROM "karyawan"
WHERE "nik" = '1371025811790004'
---
    public function getKaryawanPerID($id_karyawan)
    {
        return $this->db->table('karyawan')
            ->where('nik', $id_karyawan)
            ->get()->getResultArray();