app/Models/DaftarPenggunaModel.php

    public function getPengguna()
    {
        return $this->db->table('users')
            ->join('role', 'role.id_role=users.id_role')
            ->join('karyawan', 'karyawan.nik=users.nik')
            ->get()->getResultArray();
---
SELECT *
FROM "users"
JOIN "role" ON "role"."id_role"="users"."id_role"
JOIN "karyawan" ON "karyawan"."nik"="users"."nik"

    public function getPenggunaPerID($id_pengguna)
    {
        return $this->db->table('users')
            ->join('role', 'role.id_role=users.id_role')
            ->join('karyawan', 'karyawan.nik=users.nik')
            ->where('users.nik', $id_pengguna)
            ->get()->getResultArray();
---
SELECT *
FROM "users"
JOIN "auth_groups" ON "auth_groups"."id"="users"."id_role"
JOIN "karyawan" ON "karyawan"."nik"="users"."nik"
WHERE "users"."nik" = '1371041108920058'