app/Models/DaftarKaryawanModel.php

    public function getKaryawan()
    {
        // return $this->db->table('karyawan')
        //     ->join('kelas', 'kelas.IDKelas=siswa.IDKelas')
        //     ->join('jurusan', 'jurusan.IDJurusan=siswa.IDJurusan')
        //     ->get()->getResultArray();

        return $this->db->table('karyawan')
        ->get()->getResultArray();
---
SELECT *
FROM "karyawan"