app/Models/DaftarSertifikatModel.php

SELECT *
FROM "sertifikat"
JOIN "transaksi_sertifikat" ON "transaksi_sertifikat"."id_sertifikat"="sertifikat"."id_sertifikat"
---
    public function getSertifikat()
    {
        return $this->db->table('sertifikat')
            ->join('transaksi_sertifikat', 'transaksi_sertifikat.id_sertifikat=sertifikat.id_sertifikat')
            ->get()->getResultArray();

SELECT *
FROM "sertifikat"
---
    public function getJenisSertifikat()
    {
        return $this->db->table('sertifikat')
            ->get()->getResultArray();