app/Models/DaftarKaryawanModel.php

    public function getKaryawan()
    {
        return $this->db->table('karyawan')
            ->join('jabatan', 'jabatan.id_jabatan=karyawan.id_jabatan')
            ->join('divisi', 'divisi.id_divisi=karyawan.id_divisi')
            ->get()->getResultArray();
---
SELECT *
FROM "karyawan"
JOIN "jabatan" ON "jabatan"."id_jabatan"="karyawan"."id_jabatan"
JOIN "divisi" ON "divisi"."id_divisi"="karyawan"."id_divisi"

    public function getKaryawanPerID($id_karyawan)
    {
        return $this->db->table('karyawan')
            ->where('nik', $id_karyawan)
            ->get()->getResultArray();
---
SELECT *
FROM "karyawan"
WHERE "nik" = '1695162034'