app/Models/TransaksiModel.php

    public function getTransaksi()
    {
        return $this->db->table('transaksi_sertifikat')
            ->get()->getResultArray();
---
SELECT *
FROM "transaksi_sertifikat"

    public function getJenisTransaksi()
    {
        return $this->db->table('sertifikat')
            ->join('transaksi_sertifikat', 'transaksi_sertifikat.id_sertifikat=sertifikat.id_sertifikat')
            ->get()->getResultArray();
---
SELECT *
FROM "sertifikat"
JOIN "transaksi_sertifikat" ON "transaksi_sertifikat"."id_sertifikat"="sertifikat"."id_sertifikat"

    public function getSertifikatPerID($id_karyawan)
    {
        return $this->db->table('sertifikat')
            ->join('transaksi_sertifikat', 'transaksi_sertifikat.id_sertifikat=sertifikat.id_sertifikat')
            ->join('karyawan', 'karyawan.id_karyawan=transaksi_sertifikat.id_karyawan')
            ->where('nik', $id_karyawan)
            ->get()->getResultArray();
---
SELECT *
FROM "sertifikat"
JOIN "transaksi_sertifikat" ON "transaksi_sertifikat"."id_sertifikat"="sertifikat"."id_sertifikat"
JOIN "karyawan" ON "karyawan"."id_karyawan"="transaksi_sertifikat"."id_karyawan"
WHERE "nik" = '1371025811790004'

    public function getSertifikatPerIDLihat($id_karyawan)
    {
        return $this->db->table('sertifikat')
            ->join('transaksi_sertifikat', 'transaksi_sertifikat.id_sertifikat=sertifikat.id_sertifikat')
            ->join('karyawan', 'karyawan.id_karyawan=transaksi_sertifikat.id_karyawan')
            ->where('transaksi_sertifikat.id_karyawan', $id_karyawan)
            ->get()->getResultArray();
---
SELECT *
FROM "sertifikat"
JOIN "transaksi_sertifikat" ON "transaksi_sertifikat"."id_sertifikat"="sertifikat"."id_sertifikat"
JOIN "karyawan" ON "karyawan"."id_karyawan"="transaksi_sertifikat"."id_karyawan"
WHERE "transaksi_sertifikat"."id_karyawan" = '1695544403'